// uart.h
#ifndef UART_H
#define UART_H

#include <stdint.h>
#include "MDR32F9Q2I.h"

/*=====================================================================================
   ПИНЫ UART1 (PB5 = TX, PB6 = RX)
=====================================================================================*/
#define UART_PORT      MDR_PORTD
#define UART_RX        PORT_Pin_0
#define UART_TX        PORT_Pin_1
/*=====================================================================================
   ПРОТОТИПЫ ФУНКЦИЙ
=====================================================================================*/

// Инициализация UART2 на скорости 115200
void init_UART(void);



// Меню и обработка команд
void show_menu(void);           // Показать меню
void show_help(void);           // Помощь (аналогично меню)
void show_status(void);         // Статус светодиодов
void process_immediate_command(uint8_t cmd);  // Обработка команды

#endif // UART_H